{
  "activation_fn": "gelu",
  "apply_graphormer_init": true,
  "architectures": [
    "GraphormerForGraphClassification"
  ],
  "attention_dropout": 0.1,
  "bias": true,
  "bos_token_id": 1,
  "dropout": 0.0,
  "edge_type": "multi_hop",
  "embed_scale": null,
  "embedding_dim": 32,
  "encoder_normalize_before": true,
  "eos_token_id": 2,
  "ffn_embedding_dim": 32,
  "freeze_embeddings": false,
  "hidden_size": 32,
  "kdim": null,
  "layerdrop": 0.0,
  "max_nodes": 64,
  "model_type": "graphormer",
  "multi_hop_max_dist": 5,
  "num_atoms": 32,
  "num_attention_heads": 4,
  "num_classes": 1,
  "num_edge_dis": 16,
  "num_edges": 32,
  "num_hidden_layers": 12,
  "num_in_degree": 16,
  "num_out_degree": 16,
  "num_spatial": 8,
  "num_trans_layers_to_freeze": 0,
  "pad_token_id": 0,
  "pre_layernorm": false,
  "q_noise": 0.0,
  "qn_block_size": 8,
  "self_attention": true,
  "share_input_output_embed": false,
  "spatial_pos_max": 20,
  "torch_dtype": "float32",
  "traceable": false,
  "transformers_version": "4.29.2",
  "vdim": null
}
